Revit 2027 API
LeaderArray.Append Method
Add the item to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Leader item
)
Public Overridable Sub Append (
	item As Leader
)
public:
virtual void Append(
	Leader^ item
)
abstract Append :
        item : Leader -> unit
override Append :
        item : Leader -> unit
Parameters
item Leader
The item to be added.
See Also
Reference
LeaderArray Class
Autodesk.Revit.DB Namespace